app/controllers/auth_controller.rb

  def register
    @user = User.create(credentials)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"