app/controllers/clues_controller.rb

SELECT "clues".* FROM "clues" WHERE "clues"."user_id" = $1  [["user_id", 11]]
---
  def index
    if(current_user)
      @clues = current_user.clues
    else
      @clues = Clue.all