app/controllers/outlines_controller.rb

SELECT "outlines".* FROM "outlines"
---
  def index
    outlines = Outline.all